--- src/http_server_security.rs
+++ replace SecurityLogger::log_suspicious_activity with ()
@@ -435,18 +435,17 @@
     
     /// Log successful authentication
     pub fn log_auth_success(ip: &str, user_id: &str) {
         log::info!(target: "security::auth", "Successful authentication for user {} from IP {}", user_id, ip);
     }
     
     /// Log suspicious activity
     pub fn log_suspicious_activity(ip: &str, activity: &str) {
-        Self::log_event("SUSPICIOUS_ACTIVITY", activity, Some(ip));
-        log::error!(target: "security::suspicious", "Suspicious activity from IP {}: {}", ip, activity);
+        () /* ~ changed by cargo-mutants ~ */
     }
     
     /// Log token validation failure
     pub fn log_token_validation_failure(ip: &str, reason: &str) {
         log::warn!(target: "security::token", "Token validation failed from IP {}: {}", ip, reason);
     }
 }
 
